cmsis-svd/cmsis-svd/data/Atmel/ATSAML11D14A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DAC</name>
         <version>U22142.1.0</version>
         <description>Digital Analog Converter</description>
         <groupName>DAC</groupName>
         <prependToName>DAC_</prependToName>
         <baseAddress>0x42002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x15</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DAC_UNDERRUN_A</name>
            <value>40</value>
         </interrupt>
         <interrupt>
            <name>DAC_EMPTY</name>
            <value>41</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EOEN</name>
                     <description>External Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOEN</name>
                     <description>Internal Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LEFTADJ</name>
                     <description>Left Adjusted Data</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VPD</name>
                     <description>Voltage Pump Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DITHER</name>
                     <description>Dither Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFSEL</name>
                     <description>Reference Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>REFSELSelect</name>
                        <enumeratedValue>
                           <name>INT1V</name>
                           <description>Internal 1.0V reference</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVCC</name>
                           <description>AVCC</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VREFP</name>
                           <description>External reference</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>STARTEI</name>
                     <description>Start Conversion Event Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPTYEO</name>
                     <description>Data Buffer Empty Event Output</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEI</name>
                     <description>Invert Event Input</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>UNDERRUN</name>
                     <description>Underrun Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPTY</name>
                     <description>Data Buffer Empty Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>UNDERRUN</name>
                     <description>Underrun Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPTY</name>
                     <description>Data Buffer Empty Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>UNDERRUN</name>
                     <description>Underrun</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EMPTY</name>
                     <description>Data Buffer Empty</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATA</name>
               <description>Data</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Data value to be converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATABUF</name>
               <description>Data Buffer</description>
               <addressOffset>0xC</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>DATABUF</name>
                     <description>Data Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>Data</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATABUF</name>
                     <description>Data Buffer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
